### 1.分层索引

In [3]:
import pandas as pd
import numpy as np
data = pd.Series(np.random.randn(9),index = [['a', 'a','a','b','b','c','c','d','d'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.986803
   2    0.872021
   3   -0.397963
b  1   -1.487259
   3    1.705691
c  1    1.531691
   2    1.702606
d  2    0.715334
   3    0.629998
dtype: float64

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

**通过分层索引选择数据**

In [6]:
data['a']

1    0.986803
2    0.872021
3   -0.397963
dtype: float64

In [7]:
data['b':'c']

b  1   -1.487259
   3    1.705691
c  1    1.531691
   2    1.702606
dtype: float64

In [8]:
data.loc[['b','d']]

b  1   -1.487259
   3    1.705691
d  2    0.715334
   3    0.629998
dtype: float64

**使用二级索引对数据进行选择**

In [9]:
data.loc[:,2]

a    0.872021
c    1.702606
d    0.715334
dtype: float64

**使用unstack方法将数据在DataFrame中重新排列**

In [11]:
data.unstack()

          1         2         3
a  0.986803  0.872021 -0.397963
b -1.487259       NaN  1.705691
c  1.531691  1.702606       NaN
d       NaN  0.715334  0.629998

**unstack的反操作：stack**

In [13]:
data.unstack().stack()

a  1    0.986803
   2    0.872021
   3   -0.397963
b  1   -1.487259
   3    1.705691
c  1    1.531691
   2    1.702606
d  2    0.715334
   3    0.629998
dtype: float64

**在DataFrame中，每个轴都有分层索引**

In [14]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],[1, 2, 1, 2]],columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

**可以给分层的层级设置名称**

In [15]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [16]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### 2.重排序和层级排序

有时，我们需要重新排列轴上的层级顺序，或者按照特定层级的值对数据进行排序

swaplevel方法：该方法接收俩个层级序号或层级名称，交换这俩个层级的顺序

In [20]:
frame.swaplevel('key1','key2') # 先按key1排序，在按照key2排序

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

sort_index只能在单一层级上进行数据排序

In [21]:
frame.sort_index(level = 1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [25]:
frame.swaplevel(0, 1).sort_index(level = 0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

**按层级进行汇总统计**

In [27]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [28]:
frame.sum(level = 'color',axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### 3.使用dataframe的列进行索引

In [31]:
frame = pd.DataFrame({'a':range(7),'b':range(7, 0, -1), 'c':['one', 'one', 'one','two','two','two','two'],
                      'd':[0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

**使用set_index方法,将使用多个列作为索引**

In [33]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

默认情况下，这些列会被移除，通过设置参数drop = False，保留这些列

In [36]:
frame.set_index(['c','d'],drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

reset_index是set_index的反操作

In [37]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1